# Limpieza final de datos y uniones SQL

Como última fase del proceso, importo los .csv que he ido limpiando, y en cada uno de ellos voy a añadirles su 'id'. Esto se hace para poner este dato como 'PRIMARY KEY' de cada uno de los datos.

Para ello, importo las librerías que necesito, y aquellas funciones que pueden ser útiles en mi búsqueda.

In [2]:
import pandas as pd
pd.set_option('display.max_columns', None)

import numpy as np
import statistics as stats

import warnings
warnings.filterwarnings('ignore')

import pylab as plt
import seaborn as sns

In [3]:
pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in /Users/sarapazopadron/anaconda3/envs/clase/lib/python3.10/site-packages (2.0.23)
Requirement already satisfied: typing-extensions>=4.2.0 in /Users/sarapazopadron/anaconda3/envs/clase/lib/python3.10/site-packages (from SQLAlchemy) (4.8.0)
Requirement already satisfied: greenlet!=0.4.17 in /Users/sarapazopadron/anaconda3/envs/clase/lib/python3.10/site-packages (from SQLAlchemy) (3.0.1)
Note: you may need to restart the kernel to use updated packages.

In [4]:
pip install cryptography

Requirement already satisfied: cryptography in /Users/sarapazopadron/anaconda3/envs/clase/lib/python3.10/site-packages (41.0.5)
Requirement already satisfied: cffi>=1.12 in /Users/sarapazopadron/anaconda3/envs/clase/lib/python3.10/site-packages (from cryptography) (1.16.0)
Requirement already satisfied: pycparser in /Users/sarapazopadron/anaconda3/envs/clase/lib/python3.10/site-packages (from cffi>=1.12->cryptography) (2.21)
Note: you may need to restart the kernel to use updated packages.

In [5]:
import mysql.connector as conn
from sqlalchemy import create_engine

Conecto con MySQL a través del cursor, con sqlalchemy. Por ello, va a ser necesario utilizar mi password de SQL, la cual he añadido en el .gitignore como 'passw'.

In [6]:
with open('../passw.txt', 'r') as file:
    
    passw= file.read()

str_conn = f'mysql+pymysql://root:{passw}@localhost:3306/entradas_web'

cursor = create_engine(str_conn)

### 1. Tabla 'eventos'

In [7]:
eventos = pd.read_csv('../Data/Datos_Clean/eventos.csv', encoding='utf-8')

In [8]:
eventos.head()

,artista,eventos,dia,mes,año,precios,enlaces
0,Cariño,1 Evento,13,1,2024,"desde 19,80 €",https://www.entradas.com/artist/carino/carino-...
1,Iván Ferreiro,1 Evento,13,1,2024,"desde 38,50 €",https://www.entradas.com/artist/ivan-ferreiro/
2,The World Of Hans Zimmer,2 eventos,24,4,2024,"desde 55,00 €",https://www.entradas.com/artist/hans-zimmer/
3,The World Of Hans Zimmer,2 eventos,29,4,2024,"desde 55,00 €",https://www.entradas.com/artist/hans-zimmer/
4,Triángulo de Amor Bizarro,1 Evento,29,12,2023,"desde 19,80 €",https://www.entradas.com/artist/triangulo-de-a...

In [9]:
eventos.insert(0, 'eventos_id', range(1, len(eventos) + 1))

In [10]:
eventos.head()

,eventos_id,artista,eventos,dia,mes,año,precios,enlaces
0,1,Cariño,1 Evento,13,1,2024,"desde 19,80 €",https://www.entradas.com/artist/carino/carino-...
1,2,Iván Ferreiro,1 Evento,13,1,2024,"desde 38,50 €",https://www.entradas.com/artist/ivan-ferreiro/
2,3,The World Of Hans Zimmer,2 eventos,24,4,2024,"desde 55,00 €",https://www.entradas.com/artist/hans-zimmer/
3,4,The World Of Hans Zimmer,2 eventos,29,4,2024,"desde 55,00 €",https://www.entradas.com/artist/hans-zimmer/
4,5,Triángulo de Amor Bizarro,1 Evento,29,12,2023,"desde 19,80 €",https://www.entradas.com/artist/triangulo-de-a...

- una vez la tengo, le mando la referencia a SQL para crearla ahí y seguir trabajando los datos.

In [11]:
eventos.to_sql(name='eventos', con=cursor, if_exists='replace', index=False)

251

### 2. Tabla 'residentes'

In [12]:
residentes = pd.read_csv('../Data/Datos_Clean/residentes.csv', encoding='utf-8')

In [13]:
residentes.head()

  comunidad            residencia viajeros pernoctaciones   año  mes    total
0    Madrid  Residentes en España       Si            NaN  2023    9  564.048
1    Madrid  Residentes en España       Si            NaN  2023    8  467.045
2    Madrid  Residentes en España       Si            NaN  2023    7  563.343
3    Madrid  Residentes en España       Si            NaN  2023    6  615.313
4    Madrid  Residentes en España       Si            NaN  2023    5  567.870

In [14]:
residentes.insert(0, 'residentes_id', range(1, len(residentes) + 1))

In [15]:
residentes.head()

,residentes_id,comunidad,residencia,viajeros,pernoctaciones,año,mes,total
0,1,Madrid,Residentes en España,Si,NaN,2023,9,564.048
1,2,Madrid,Residentes en España,Si,NaN,2023,8,467.045
2,3,Madrid,Residentes en España,Si,NaN,2023,7,563.343
3,4,Madrid,Residentes en España,Si,NaN,2023,6,615.313
4,5,Madrid,Residentes en España,Si,NaN,2023,5,567.870

In [16]:
residentes.to_sql(name='residentes', con=cursor, if_exists='replace', index=False)

74

### 3. Tabla 'no_residentes'

In [17]:
no_residentes = pd.read_csv('../Data/Datos_Clean/no_residentes.csv', encoding='utf-8')

In [18]:
no_residentes.insert(0, 'no_residentes_id', range(1, len(no_residentes) + 1))

In [19]:
no_residentes.head()

,no_residentes_id,comunidad,residencia,viajeros,pernoctaciones,año,mes,total
0,1,Madrid,Residentes en el Extranjero,Si,NaN,2023,9,583.605
1,2,Madrid,Residentes en el Extranjero,Si,NaN,2023,8,539.019
2,3,Madrid,Residentes en el Extranjero,Si,NaN,2023,7,571.252
3,4,Madrid,Residentes en el Extranjero,Si,NaN,2023,6,546.259
4,5,Madrid,Residentes en el Extranjero,Si,NaN,2023,5,553.960

In [20]:
no_residentes.to_sql(name='no_residentes', con=cursor, if_exists='replace', index=False)

74

### 4. Tabla 'asistencia'

In [21]:
asistencia = pd.read_csv('../Data/Datos_Clean/asistencia.csv', encoding='utf-8')

In [22]:
asistencia.insert(0, 'asistencia_id', range(1, len(asistencia) + 1))

In [23]:
asistencia.head()

,asistencia_id,comunidad,asistencia(2021-2022),conciertos,clasica,actual
0,1,Madrid,Total han asistido en el último año,"16,7","5,6","12,6"
1,2,Madrid,En los últimos tres meses,"9,5","2,3","7,6"
2,3,Madrid,Entre tres meses y un año,"7,2","3,3",5
3,4,Madrid,Entre tres meses y un año,"7,2","3,3",5
4,5,Madrid,Nunca o casi nunca,33,"61,4","38,3"

In [24]:
asistencia.to_sql(name='asistencia', con=cursor, if_exists='replace', index=False)

5

YA ESTARÍAN LAS 4 TABLAS IMPORTADAS EN SQL.